# Import libraries

In [378]:
# Import libraries

import pandas as pd
import numpy as np
import os

# Create a dataframe

In [379]:
# Create a dataframe
df_test = pd.DataFrame()

# Create a mixed type column

In [380]:
# Create a mixed type column
df_test['mix'] = ['a', 'b', 1, True]

# Create a mixed type column

In [381]:
# Create a mixed type column

for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

C:\Users\New User\AppData\Local\Temp\ipykernel_10720\772068622.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)

# Define path to Dataset folder

In [382]:
# Assigning path
path=r'C:\Users\New User\OneDrive\Documents\05-2024 Instacart Basket Analysis'

# Import Dataset

In [383]:
# Importing data set products.csv
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'), index_col = False)

In [384]:
# Importing data set orders_wrangled.csv
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = False)

# Checking for missing values in dataset

In [385]:
# Checking for missing values in df_prods
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

# Create a subset of the dataframe containing only missing values

In [386]:
# Create a subset of the dataframe containing only missing values
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [387]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

# Compare number of rows in dataframe with the numbers in the subset

In [388]:
# Compare number of rows in dataframe with the numbers in the subset
df_prods.shape

(49693, 5)

# Create a new dataframe without missing values

In [389]:
# Create a new dataframe without missing values
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

# Display Info on the dataset

In [390]:
df_prods_clean

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3
...,...,...,...,...,...
49688,49684,"Vodka, Triple Distilled, Twist of Vanilla",124,5,5.3
49689,49685,En Croute Roast Hazelnut Cranberry,42,1,3.1
49690,49686,Artisan Baguette,112,3,7.8
49691,49687,Smartblend Healthy Metabolism Dry Cat Food,41,8,4.7
49692,49688,Fresh Foaming Cleanser,73,11,13.5

In [391]:
# Knowing the number of rows in the newly cleaned dataframe
df_prods_clean.shape

(49677, 5)

# Checking for duplicates in the df_prods_clean dataframe

In [392]:
# Checking for duplicates in the df_prods_clean dataframe
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [393]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

# Create a new dataframe without duplicates

In [394]:
# Create a new dataframe without duplicates
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [395]:
df_prods_clean_no_dups

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3
...,...,...,...,...,...
49688,49684,"Vodka, Triple Distilled, Twist of Vanilla",124,5,5.3
49689,49685,En Croute Roast Hazelnut Cranberry,42,1,3.1
49690,49686,Artisan Baguette,112,3,7.8
49691,49687,Smartblend Healthy Metabolism Dry Cat Food,41,8,4.7
49692,49688,Fresh Foaming Cleanser,73,11,13.5

In [396]:
# Know the number of rows in the new dataframe
df_prods_clean_no_dups.shape

(49672, 5)

In [397]:
# Exercise 4.5 Task Procedures

# Checking the descriptive statistics of df_ords dataframe

In [398]:
# Task 2: Checking the descriptive statistics of df_ords dataframe
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

# The data looks normal. Just few observations.

# "order_hour_of_day" column has min of 0, max of 23, median of 13, and mean 13.45; a total of exactly 24 hours of a day. No discrepancies. 
# "days_since_last_order" column has min of 0 and max of 30; total of exactly a month.median is 7.0, and mean is 11.1; Dataset is right-skewed.
# "days_since_last_order" column has lesser counts compared to other columns; indicating missing values.

# Check for mixed data types in the df_ords

In [400]:
# Task 3: Check for mixed data types in the df_ords

mixed_type_columns = df_ords.select_dtypes(include='object').columns

# Print the mixed-type columns, if any
if len(mixed_type_columns) > 0:
    print("The df_ords dataframe contains mixed-type columns:")
    print(mixed_type_columns)
else:
    print("The df_ords dataframe does not contain mixed-type columns.")

The df_ords dataframe does not contain mixed-type columns.

# Check for mixed data types in the df_ords using info () function

In [401]:
# Check for mixed data types in the df_ords using info () function
df_ords.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3421083 entries, 0 to 3421082
Data columns (total 7 columns):
 #   Column                 Dtype
---  ------                 -----
 0   Unnamed: 0             int64
 1   order_id               int64
 2   user_id                int64
 3   order_number           int64
 4   orders_day_of_week     int64
 5   order_hour_of_day      int64
 6   days_since_last_order  float64
dtypes: float64(1), int64(6)
memory usage: 182.7 MB

In [402]:
df_ords.shape

(3421083, 7)

In [403]:
# Task 5: Checking for missing values in df_ords
df_ords.isnull().sum()

Unnamed: 0                    0
order_id                      0
user_id                       0
order_number                  0
orders_day_of_week            0
order_hour_of_day             0
days_since_last_order    206209
dtype: int64

# Creating a subset that contains only missing values

In [404]:
# Creating a subset that contains only missing values
df_zip = df_ords[df_ords['days_since_last_order'].isnull() == True]

In [405]:
df_zip

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order
0,0,2539329,1,1,2,8,NaN
11,11,2168274,2,1,2,11,NaN
26,26,1374495,3,1,1,14,NaN
39,39,3343014,4,1,6,11,NaN
45,45,2717275,5,1,3,12,NaN
...,...,...,...,...,...,...,...
3420930,3420930,969311,206205,1,4,12,NaN
3420934,3420934,3189322,206206,1,3,18,NaN
3421002,3421002,2166133,206207,1,6,19,NaN
3421019,3421019,2227043,206208,1,1,15,NaN
3421069,3421069,3154581,206209,1,3,11,NaN

# 206209 missing values observed in the days_since_last_order column
# Reason for missing values could be that they were never recorded in the first place.

# Task 6: Addressing or handling missing values with appropriate method or approach.
# Replace missing data with the median. 
# The median (7) is significantly lower than the mean (11.1), suggesting that the data might be right-skewed.
# For skewed distributions, the median is typically a better measure of central tendency because it is not influenced by outliers and better represents the center of the distribution

# Checking for median

In [408]:
# Checking for median
df_ords.median()

Unnamed: 0               1710541.0
order_id                 1710542.0
user_id                   102689.0
order_number                  11.0
orders_day_of_week             3.0
order_hour_of_day             13.0
days_since_last_order          7.0
dtype: float64

# Replace missing values with median

In [409]:
# Replace missing values with median
df_ords['days_since_last_order'].fillna(7.0, inplace=True)

In [410]:
df_ords

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order
0,0,2539329,1,1,2,8,7.0
1,1,2398795,1,2,3,7,15.0
2,2,473747,1,3,3,12,21.0
3,3,2254736,1,4,4,7,29.0
4,4,431534,1,5,4,15,28.0
...,...,...,...,...,...,...,...
3421078,3421078,2266710,206209,10,5,18,29.0
3421079,3421079,1854736,206209,11,4,10,30.0
3421080,3421080,626363,206209,12,1,12,18.0
3421081,3421081,2977660,206209,13,1,12,7.0
3421082,3421082,272231,206209,14,6,14,30.0

# Checking for duplicate values in df_ords

In [411]:
# Task 7: Checking for duplicate values in df_ords
df_ords_dups = df_ords[df_ords.duplicated()]

In [412]:
df_ords_dups

Empty DataFrame
Columns: [Unnamed: 0, order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, days_since_last_order]
Index: []

# No duplicate values found in the df_ords dataframe
# Empty sets was returned for the columns header

In [414]:
df_ords_dups.shape

(0, 7)

# Task 8: Address duplicate values using appropriate method.
# No duplicate in the above task. Empty sets with only headers was returned

# Define export path and export the dataset

In [416]:
# Task 9: # Export df_prods_clean_no_dups dataframe as "products_checked.csv"

df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data','Prepared Data', 'products_checked.csv'))

#  Export df_ords dataframe as "orders_checked.csv"

df_ords.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_checked.csv'))